{
  "irVersion": "1.0",
  "project": "structured-profile",
  "repository": "https://github.com/grokify/structured-profile",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-04-19",
      "highlights": [
        { "description": "Initial release with structured profile schema, JD parsing, and AI-powered resume generation pipeline" }
      ],
      "added": [
        { "description": "Structured profile JSON schema for career data (experience, education, skills, achievements)" },
        { "description": "Job description parser extracting requirements from markdown files" },
        { "description": "Profile-to-JD matcher with keyword-based scoring and gap analysis" },
        { "description": "JSON file-based profile storage with default directory `~/.sprofile/profiles/`" },
        { "description": "Resume generation service creating tailored resumes from profile + JD" },
        { "description": "Cover letter generation service with customization options" },
        { "description": "PDF/DOCX export via Pandoc with configurable fonts and margins" },
        { "description": "Data migration utilities for converting legacy formats" },
        { "description": "`sprofile` CLI with `resume generate` and `cover generate` commands" },
        { "description": "Job-match evaluation schema (matcheval) for structured profile-to-JD scoring" },
        { "description": "Match category types: technical_skills, leadership, domain_experience, etc." },
        { "description": "Match types: exact, semantic, partial, threshold, boolean, weighted" },
        { "description": "AI agent specifications for semantic resume generation pipeline" },
        { "description": "`jd-analyst` agent for semantic job description parsing" },
        { "description": "`profile-matcher` agent for profile-to-JD matching with scoring" },
        { "description": "`resume-generator` agent for tailored resume creation" },
        { "description": "`resume-evaluator` agent for LLM-as-Judge quality scoring" },
        { "description": "`resume-refiner` agent for feedback-based improvement" },
        { "description": "`resume-coordinator` agent for pipeline orchestration" }
      ],
      "documentation": [
        { "description": "README with installation and usage instructions" },
        { "description": "CLAUDE.md AI agent guide for resume generation workflow" },
        { "description": "Product requirements document (PRD)" },
        { "description": "Technical requirements document (TRD)" },
        { "description": "Development roadmap" }
      ],
      "tests": [
        { "description": "Sample job description for integration tests" }
      ],
      "infrastructure": [
        { "description": "Go module configuration with dependencies" },
        { "description": "golangci-lint configuration" },
        { "description": "Makefile for build, test, and lint commands" },
        { "description": "Claude Code agent configuration" }
      ]
    }
  ]
}
